# '=^.^=' * (10*(40**5))

n = 10
m = 7
print(('Ш'*10 + '\n') * 10)
print(('Ш'*n + '\n') * m)

# Создать счетчик строк
counter = 0
# ПОКА счетчик строк меньше 10
#     Написать 10 букв Ш
#     Прибавить к счетчику единичку

while counter < 10:
    print('Ш' * 10)
    counter += 1