mystr = 'Wera'
print(len(mystr)) 
first = mystr[0] 
print(first)
# Написать программу, которая выводит все буквы слова: 
# 1. В столбик 
# 2. В строчку через пробел 
# 3. В столбик в обратном порядке 
# 4*. В столбик, но все буквы маленькие

