# Алгоритм 
# 1. Задать пользователю вопрос об имени 
# 2. Получить и запомнить (сохранить) ответ 
# 3. Создать строку приветствия 
# 4. Добавить в неё полученное имя 
# 5. Вывести приветствие с именем на экран

# Чтобы  создать переменную, 
# надо придумать ей название из букв, цифр и 
# символов подчеркивания, нельзя начинать с цифры 
# = это знак присваивания, записи, сохранения  
# СПРАВА НАЛЕВО! из правой части в левую 
# a = 5   # создать переменную со значением 5

# == это знак проверки на равенство

# Вопрос пользователю: input('Текст вопроса')
ответ = input('Как тебя зовут?')
# Лучше по-английски
# answer = input('Как тебя зовут?')

# Как увидеть значение переменной? 
# Можно вывести на экран 
# Можно воспользоваться отладчиком
print('Привет???' + 'ответ!!!')
print('Привет'+ответ)

# Задание: сделать приветствие вида Привет, Вера! 
# т.е. с запятой, пробелом и восклицательным знаком

